app/controllers/articles_controller.rb

	def update
		@article = finder
		@article.update(article_params)
---
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "how even does one do things??"], ["updated_at", "2015-12-24 00:46:01.233174"], ["id", 6]]

	def destroy
		@article = finder #Article.find(params[:id])
		@article.destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 3]]